x1 = [-3, -1, 1, 2, 0, -2];
x2 = [2, 1, -1, -2, 4, -2];
Y = [-1, 3, 1, -3, 8, 6];
alpha = 0.05;
n = length(x1);
m = 2;
x1 = x1'; x2 = x2'; Y = Y';
X = [ones(n, 1), x1, x2];
XtX = X' * X;
XtY = X' * Y;
B = XtX\XtY;
disp('--------------------------------------------------------------------------------')
disp('Уравнение регрессии в виде линейного алгебраического полинома от двух переменных');
disp('--------------------------------------------------------------------------------')
disp('Оценки коэффициентов регрессии: ');
disp(B);
disp('Уравнение регрессии:');
fprintf('y = %.2f + %.2f * x1 + %.2f * x2\n\n', B);
Ycp = mean(Y);
Yemp = B(3).*x2 + B(2).*x1 + B(1);
F = (sum((Yemp - Ycp).^2)./m)./(sum((Y - Yemp).^2)./(n - m - 1));
disp('Статистика F: ');
disp(F);
k2F = finv(1 - alpha, m, n - m - 1);
disp('Критическое значение k2:');
disp(k2F);
if k2F < F
disp('Принимается гипотеза H1. Всё ок');
else
disp('Принимается гипотеза H0. Уравнение регрессии не значимо');
end
subplot(1,3,1);
[Xg1,Yg1] = meshgrid(-4:.5:4);
Zg1 = B(3).*Yg1 + B(2).*Xg1 + B(1);
mesh(Xg1,Yg1,Zg1)
hold on;
plot3(x1, x2, Y, 'rx')
disp('--------------------------------------------------------------------------------')
disp('Уравнение регрессии в виде неполного квадратичного полинома');
disp('--------------------------------------------------------------------------------')
X = [ones(n, 1), x1, x2, x1.*x2];
XtX = X' * X;
XtY = X' * Y;
B = XtX\XtY;
disp('Оценки коэффициентов регрессии: '); disp(B);disp('Уравнение регрессии:');
fprintf('y = %.2f + %.2f * x1 + %.2f * x2 + %.2f * x1 * x2\n\n', B);
Ycp = mean(Y);
Yemp =B(4).*x2.*x1+ B(3).*x2 + B(2).*x1 + B(1);
F = (sum((Yemp - Ycp).^2)./m)./(sum((Y - Yemp).^2)./(n - m - 1));
disp('Статистика F: ');
disp(F);
k2F = finv(1 - alpha, m, n - m - 1);
disp('Критическое значение k2:');
disp(k2F);
if k2F < F
disp('Принимается гипотеза H1. Всё ок');
else
disp('не ок');
end
S2 = ((Y - Yemp)') * (Y- Yemp)./(n-m-1);
covMatr = S2.*inv(X' * X);
tB = [abs(B(1))/covMatr(1,1),abs(B(2))/covMatr(2,2),abs(B(3))/covMatr(3,3),abs(B(4))/covMatr(4,4)];
disp("tB"); disp(tB)
t_k = tinv(1 - 0.025, n - m - 1);
disp("t_k:");disp(t_k);
for c = 1:length(B)
if tB(c) < t_k
B(c) = 0;
end
end
disp(B)
disp(length(B))
subplot(1,3,2);
[Xg2,Yg2] = meshgrid(-4:.5:4);
Zg2 = B(4).*Yg2.*Xg2 + B(3).*Yg2 + B(2).*Xg2 + B(1);
mesh(Xg2,Yg2,Zg2)
hold on;
plot3(x1, x2, Y, 'rx')
disp('--------------------------------------------------------------------------------')
disp('Уравнение регрессии после отсеивания незначащих коэффициентов');
disp('--------------------------------------------------------------------------------')
disp('Уравнение регрессии:');
fprintf('y = %.2f + %.2f * x1 + %.2f * x2 + %.2f * x1 * x2\n\n', B);
Yemp =B(4).*x2.*x1+ B(3).*x2 + B(2).*x1 + B(1);
F = (sum((Yemp - Ycp).^2)./m)./(sum((Y - Yemp).^2)./(n - m - 1));
disp('Статистика F: ');
disp(F);
k2F = finv(1 - alpha, m, n - m - 1);
disp('Критическое значение k2:');
disp(k2F);
if k2F < F
disp('Принимается гипотеза H1. Всё ок');
else
disp('не ок');
end
%Вывод 3 график
subplot(1,3,3);
[Xg3,Yg3] = meshgrid(-4:.5:4);
Zg3 = B(4).*Yg3.*Xg3 + B(3).*Yg3 + B(2).*Xg3 + B(1);mesh(Xg3,Yg3,Zg3)
hold on;
plot3(x1, x2, Y, 'rx')
